_posts/2015-03-26-Compile-Emacs-24-In-OS-X.html
---
layout : post
title : Compile Emacs-24 In OS X 10.9
categories : 未分类
---
<p>
Simply a tip: if you failed to compile Emacs under OS X 10.9, and it is caused by <code>tputs</code>:
</p>

<div class="org-src-container">

<pre class="src src-text"><span class="linenr">1: </span>The required function `tputs' was not found in any library.
<span class="linenr">2: </span>The following libraries were tried (in order):
<span class="linenr">3: </span>  libtinfo, libncurses, libterminfo, libtermcap, libcurses
<span class="linenr">4: </span>Please try installing whichever of these libraries is most appropriate
<span class="linenr">5: </span>for your system, together with its header files.
<span class="linenr">6: </span>For example, a libncurses-dev(el) or similar package.
</pre>
</div>

<p>
This can be resolved by specifying <code>--without-imagemagick</code> during configuration.
</p>


<p>
If you use gentoo prefix, you can try following patch:
</p>

<div class="org-src-container">

<pre class="src src-text"><span class="linenr"> 1: </span>*** 167,173 ****
<span class="linenr"> 2: </span>        fi
<span class="linenr"> 3: </span>    elif use aqua; then
<span class="linenr"> 4: </span>        einfo "Configuring to build with Nextstep (Cocoa) support"
<span class="linenr"> 5: </span>!       myconf+=" --with-ns --disable-ns-self-contained --without-imagemagick"
<span class="linenr"> 6: </span>        myconf+=" --without-x"
<span class="linenr"> 7: </span>    else
<span class="linenr"> 8: </span>        myconf+=" --without-x --without-ns"
<span class="linenr"> 9: </span>--- 167,173 ----
<span class="linenr">10: </span>        fi
<span class="linenr">11: </span>    elif use aqua; then
<span class="linenr">12: </span>        einfo "Configuring to build with Nextstep (Cocoa) support"
<span class="linenr">13: </span>!       myconf+=" --with-ns --disable-ns-self-contained"
<span class="linenr">14: </span>        myconf+=" --without-x"
<span class="linenr">15: </span>    else
<span class="linenr">16: </span>        myconf+=" --without-x --without-ns"
</pre>
</div>
